Tekla Open API Reference for Tekla Structures 2025
CatalogHandler.GetSteelFinishItems Method
 Returns the collection of all steel finish items.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static IEnumerable<FinishItem> GetSteelFinishItems()
Public Shared Function GetSteelFinishItems As IEnumerable(Of FinishItem)
Return Value
Type: IEnumerable<FinishItem>
The collection of all steel finish items.
See Also
Reference
CatalogHandler Class
Tekla.Structures.Catalogs Namespace